---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Lighting.SpotLightDistribution
source: html/48cb80d8-db30-3330-b3e1-8dd71a7b9d9a.htm
---
# SpotLightDistribution Members

Creates a spot light distribution object with the following values;
 PI/6 radians spot beam angle PI/2 radians spot field angle PI/6 radians tilt angle